In [ ]:
"""Find emp_no of all the employees who are not managers"""

In [ ]:
"""SQL table creation and data insertion"""
drop table if exists  `dept_manager` ; 
drop table if exists  `employees` ; 
CREATE TABLE `dept_manager` (
`dept_no` char(4) NOT NULL,
`emp_no` int(11) NOT NULL,
`from_date` date NOT NULL,
`to_date` date NOT NULL,
PRIMARY KEY (`emp_no`,`dept_no`));
CREATE TABLE `employees` (
`emp_no` int(11) NOT NULL,
`birth_date` date NOT NULL,
`first_name` varchar(14) NOT NULL,
`last_name` varchar(16) NOT NULL,
`gender` char(1) NOT NULL,
`hire_date` date NOT NULL,
PRIMARY KEY (`emp_no`));
INSERT INTO dept_manager VALUES('d001',10002,'1996-08-03','9999-01-01');
INSERT INTO dept_manager VALUES('d002',10003,'1990-08-05','9999-01-01');
INSERT INTO employees VALUES(10001,'1953-09-02','Georgi','Facello','M','1986-06-26');
INSERT INTO employees VALUES(10002,'1964-06-02','Bezalel','Simmel','F','1985-11-21');
INSERT INTO employees VALUES(10003,'1959-12-03','Parto','Bamford','M','1986-08-28');

In [ ]:
"""SQL solution"""
SELECT emp_no
FROM employees
WHERE emp_no NOT IN
(SELECT emp_no FROM dept_manager)

In [3]:
"""Pandas dataframe creation"""
import pandas as pd
import numpy as np

t_manager = np.array([['d001',10002,'1996-08-03','9999-01-01'],
                      ['d002',10003,'1990-08-05','9999-01-01']])
t_employee = np.array([[10001,'1953-09-02','Georgi','Facello','M','1986-06-26'],
                       [10002,'1964-06-02','Bezalel','Simmel','F','1985-11-21'],
                       [10003,'1959-12-03','Parto','Bamford','M','1986-08-28']])

dept_manager = pd.DataFrame(data=t_manager, columns=['dept_no', 'emp_no', 'from_date', 'to_date'])
employees = pd.DataFrame(data=t_employee, columns=['emp_no', 'birth_date', 'first_name', 'last_name', 'gender', 'hire_date'])
dept_manager.head()

  dept_no emp_no   from_date     to_date
0    d001  10002  1996-08-03  9999-01-01
1    d002  10003  1990-08-05  9999-01-01

In [4]:
employees.head()

  emp_no  birth_date first_name last_name gender   hire_date
0  10001  1953-09-02     Georgi   Facello      M  1986-06-26
1  10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2  10003  1959-12-03      Parto   Bamford      M  1986-08-28

In [28]:
pd.merge(employees, dept_manager, on='emp_no', how='left')

,emp_no,birth_date,first_name,last_name,gender,hire_date,dept_no,from_date,to_date
0,10001,1953-09-02,Georgi,Facello,M,1986-06-26,NaN,NaN,NaN
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,d001,1996-08-03,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,d002,1990-08-05,9999-01-01

In [29]:
pd.merge(employees, dept_manager, on='emp_no', how='left').dropna()

,emp_no,birth_date,first_name,last_name,gender,hire_date,dept_no,from_date,to_date
1,10002,1964-06-02,Bezalel,Simmel,F,1985-11-21,d001,1996-08-03,9999-01-01
2,10003,1959-12-03,Parto,Bamford,M,1986-08-28,d002,1990-08-05,9999-01-01

In [35]:
pd.DataFrame(pd.merge(employees, dept_manager, on='emp_no', how='left').dropna().emp_no)

  emp_no
1  10002
2  10003

In [34]:
idx = []
for i in range(len(employees)):
    if employees.emp_no[i] in list(dept_manager.emp_no):
        idx.append(i)
pd.DataFrame(employees.iloc[idx].emp_no)

  emp_no
1  10002
2  10003